MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F256D.atdf
      <value-group caption="Channel Busy bit" name="DCH1CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH2CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3"/>
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2"/>
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1"/>
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0"/>
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH2CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH2CON__CHAEN">
         <value caption="Channel is continuously enabled and not automatically disabled after a block transfer is complete" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH2CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH2CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH2CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH2CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH2CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH3CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3"/>
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2"/>
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1"/>
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0"/>
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH3CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH3CON__CHAEN">
         <value caption="Channel is continuously enabled and not automatically disabled after a block transfer is complete" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH3CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH3CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH3CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH3CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH3CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH0ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH0ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH0ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1" />
         <value caption="Pattern match is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Abort Transfer bit" name="DCH0ECON__CABORT">
         <value caption="A DMA transfer is aborted when this bit is written to a 1" name="" value="0x1" />
         <value caption="This bit always reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Forced Transfer bit" name="DCH0ECON__CFORCE">
         <value caption="A DMA transfer is forced to begin when this bit is written to a 1" name="" value="0x1" />
         <value caption="This bit always reads 0" name="" value="0x0" />
      </value-group>
